ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor-0417 copy/User/main.c
/*
 * 主控调度中心:
 * 1. 负责系统状态机、按键/串口命令、控制周期调度、遥测和显示刷新。
 * 2. 设计上把“业务编排”放在这里，把“底层驱动”和“闭环控制”下沉到各自模块。
 * 3. 读这个文件时建议按顺序看:
 *    - 全局状态
 *    - 启停状态机
 *    - 命令解析
 *    - run_control / run_imu_update / run_display
 */
#include "stm32f10x.h"
#include "config.h"
#include "pid_controller.h"
#include "motor_driver.h"
#include "sensor_fusion.h"
#include "bsp_uart.h"
#include "bsp_key.h"
#include "bsp_oled.h"
#include "Delay.h"
#include "line_track.h"
#include "tune_params.h"
#include "stm32f10x_it.h"
#include <stdio.h>
#include <string.h>

/* ========== System State ==========
 * 这里集中保存主循环共享的运行态数据。
 * 原则上:
 * - 纯驱动内部状态留在各自模块内部
 * - 需要跨多个调度阶段共享的状态才放到这里
 */

static SystemState_t g_sysState = SYS_STOP;
static ControlMode_t g_mode = MODE_STRAIGHT;
static DualLoopState_t g_pid;
static Encoder_Data_t g_encoder;
static IMU_Data_t g_imu;

static volatile uint32_t g_tickMs = 0;
static volatile uint8_t g_controlFlag = 0;
static uint32_t g_runStartTick = 0;
static uint32_t g_lastTelemetryTick = 0;
static uint32_t g_lastControlTick = 0;
static uint32_t g_lastImuTick = 0;
static uint32_t g_lastImuRecoverTick = 0;
static uint32_t g_lastDisplayTick = 0;
static uint8_t g_displayDirty = 1;
static float g_fastYawRate = 0.0f;
static uint32_t g_experimentId = 0;
static uint8_t g_experimentActive = 0;
static uint32_t g_experimentHostSyncUntilTick = 0;

typedef enum
{
    EXP_TRIGGER_AUTO = 0,
    EXP_TRIGGER_KEY,
    EXP_TRIGGER_UART
} ExperimentTrigger_t;

/* ========== System Timer (TIM4 1ms) ========== */

static void Timer_Init(void)
{
    TIM_TimeBaseInitTypeDef tb;
    NVIC_InitTypeDef n;

    /* TIM4 以 1ms 为基本节拍，控制周期则由 Main_TimerTickISR 内的分频器决定。 */
    RCC_APB1PeriphClockCmd(SYS_TIM_RCC, ENABLE);

    tb.TIM_ClockDivision = TIM_CKD_DIV1;
    tb.TIM_CounterMode = TIM_CounterMode_Up;
    tb.TIM_Period = SYS_TIM_PERIOD - 1;
    tb.TIM_Prescaler = SYS_TIM_PRESCALER - 1;
    tb.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(SYS_TIM, &tb);

    TIM_ITConfig(SYS_TIM, TIM_IT_Update, ENABLE);
    TIM_ClearITPendingBit(SYS_TIM, TIM_IT_Update);

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    n.NVIC_IRQChannel = SYS_TIM_IRQn;
    n.NVIC_IRQChannelCmd = ENABLE;
    n.NVIC_IRQChannelPreemptionPriority = 2;
    n.NVIC_IRQChannelSubPriority = 0;
    NVIC_Init(&n);

    g_tickMs = 0;
    TIM_Cmd(SYS_TIM, ENABLE);
}

void Main_TimerTickISR(void)
{
    static uint8_t divider = 0;
    /* 中断里只做“打点”和轻量轮询，不做复杂控制运算。 */
    g_tickMs++;
    divider++;
    if (divider >= CONTROL_PERIOD_MS)
    {
        divider = 0;
        g_controlFlag = 1;
    }
    BspKey_Tick(g_tickMs);
}

/* ========== State Machine Transitions ========== */

static uint8_t is_running(void)
{
    /* 只有直线和循迹两种状态算“控制器正在驱动车轮”。 */
    return (g_sysState == SYS_STRAIGHT || g_sysState == SYS_TRACKING) ? 1u : 0u;
}

static uint8_t experiment_host_sync_active(void)
{
    return (g_experimentHostSyncUntilTick != 0u && g_tickMs < g_experimentHostSyncUntilTick) ? 1u : 0u;
}

static const char *experiment_trigger_str(ExperimentTrigger_t trigger)
{
    switch (trigger)
    {
    case EXP_TRIGGER_KEY:  return "KEY";
    case EXP_TRIGGER_UART: return "UART";
    default:               return "AUTO";
    }
}

static void report_experiment_start(ExperimentTrigger_t trigger,
                                    uint8_t skipStartupSecondTurn)
{
    char buf[96];

    sprintf(buf,
            "EVT:EXP_START,id=%lu,src=%s,mode=%c,skip=%u\r\n",
            (unsigned long)g_experimentId,
            experiment_trigger_str(trigger),
            (g_mode == MODE_TRACK) ? 'T' : 'S',
             (unsigned)skipStartupSecondTurn);
    BspUart_SendString(buf);
}

static void report_experiment_stop(ExperimentTrigger_t trigger, uint32_t durationMs)
{
    char buf[96];

    sprintf(buf,
            "EVT:EXP_STOP,id=%lu,src=%s,mode=%c,dur=%lu\r\n",
            (unsigned long)g_experimentId,
            experiment_trigger_str(trigger),
            (g_mode == MODE_TRACK) ? 'T' : 'S',
            (unsigned long)durationMs);
    BspUart_SendString(buf);
}

static void transition_start(ExperimentTrigger_t trigger)
{
    const TuneRuntime_t *tune = TuneParams_Get();
    float startSpeed;

    if (is_running())
        return;

    if (experiment_host_sync_active())
        g_experimentId++;
    g_experimentActive = 1u;
    BNO085_ResetAttitude(&g_imu);
    memset(&g_encoder, 0, sizeof(g_encoder));
    Encoder_Reset();

    /* 起跑只清空运行状态，不重载 PID 默认值。
       这样串口在线调过的参数不会在每次启停时被偷偷覆盖掉。 */
    DualLoop_ResetAll(&g_pid);
    if (g_mode == MODE_STRAIGHT)
    {
        g_sysState = SYS_STRAIGHT;
        g_pid.targetYaw = 0.0f;
    }
    else
    {
        g_sysState = SYS_TRACKING;
        LineTrack_Start(g_tickMs, g_imu.yaw);
        g_pid.targetYaw = LineTrack_GetTargetYaw();
    }
    /* start_speed 单独控制“实验起步那一拍”的内部斜坡起点。
       设为 0 时仍然保持直接按目标速度起跑；设为较小值则可模拟真实跑到 S 弯前的入弯速度。 */
    startSpeed = tune->common.startSpeed;
    if (startSpeed > 0.0f && startSpeed < g_pid.targetSpeed)
        g_pid.speedRampTarget = startSpeed;
    else
        g_pid.speedRampTarget = g_pid.targetSpeed;

    g_fastYawRate = 0.0f;
    g_runStartTick = g_tickMs;
    g_lastImuTick = g_tickMs;
    report_experiment_start(trigger, 0u);
    BspOled_ShowExperimentId(g_experimentId);
    MotorDriver_Enable();
    g_displayDirty = 1;
}

static void transition_stop(ExperimentTrigger_t trigger)
{
    uint32_t durationMs = 0u;

    if (g_experimentActive)
    {
        durationMs = g_tickMs - g_runStartTick;
        report_experiment_stop(trigger, durationMs);
    }

    MotorDriver_Stop();
    MotorDriver_Disable();
    LineTrack_Stop();
    DualLoop_ResetAll(&g_pid);
    g_sysState = SYS_STOP;
    g_experimentActive = 0u;
    BspOled_ShowExperimentId(g_experimentId);
    g_displayDirty = 1;
}

static void transition_toggle_mode(void)
{
    if (is_running())
        return;
    g_mode = (g_mode == MODE_STRAIGHT) ? MODE_TRACK : MODE_STRAIGHT;
    if (g_mode == MODE_STRAIGHT)
        DualLoop_LoadStraightDefaults(&g_pid);
    else
        DualLoop_LoadTrackDefaults(&g_pid);
    LineTrack_RefreshTune();
    g_displayDirty = 1;
}

/* ========== Key Event Handler ========== */

