ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor-0417 copy/User/main.c
        i = 0u;
        while ((cmd + 6 + i) < comma && i < (uint8_t)(sizeof(keyBuf) - 1u))
        {
            keyBuf[i] = cmd[6 + i];
            i++;
        }
        keyBuf[i] = '\0';
        if (i == 0u || !cmd_copy_token(comma + 1, valBuf, sizeof(valBuf)))
        {
            BspUart_SendString("ERR:PSET\r\n");
            return;
        }
        apply_param_write(keyBuf, valBuf);
        return;
    }
    if (strcmp(cmd, "#SAVE!") == 0)
    {
        BspUart_SendString("ERR:SAVE=UNSUPPORTED\r\n");
        return;
    }
    if (strncmp(cmd, "#MARK=", 6) == 0)
    {
        if (!cmd_copy_token(cmd + 6, keyBuf, sizeof(keyBuf)))
        {
            BspUart_SendString("ERR:MARK\r\n");
            return;
        }
        sprintf(buf,
                "EVT:MARK,name=%s,exp=%lu,t=%lu\r\n",
                keyBuf,
                (unsigned long)g_experimentId,
                (unsigned long)g_tickMs);
        BspUart_SendString(buf);
        return;
    }
    if (strcmp(cmd, "#MODE=STRAIGHT!") == 0)
    {
        if (!is_running())
        {
            g_mode = MODE_STRAIGHT;
            DualLoop_LoadStraightDefaults(&g_pid);
            LineTrack_RefreshTune();
            g_displayDirty = 1;
            BspUart_SendString("OK:MODE=STRAIGHT\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#MODE=TRACK!") == 0)
    {
        if (!is_running())
        {
            g_mode = MODE_TRACK;
            DualLoop_LoadTrackDefaults(&g_pid);
            LineTrack_RefreshTune();
            g_displayDirty = 1;
            BspUart_SendString("OK:MODE=TRACK\r\n");
        }
        return;
    }
    if (strncmp(cmd, "#SPD=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("SPD", cmd + 5))
            BspUart_SendString("ERR:SPD\r\n");
        return;
    }
    if (strncmp(cmd, "#SKP=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("SKP", cmd + 5))
            BspUart_SendString("ERR:SKP\r\n");
        return;
    }
    if (strncmp(cmd, "#SKI=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("SKI", cmd + 5))
            BspUart_SendString("ERR:SKI\r\n");
        return;
    }
    if (strncmp(cmd, "#SKD=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("SKD", cmd + 5))
            BspUart_SendString("ERR:SKD\r\n");
        return;
    }
    if (strncmp(cmd, "#AKP=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("AKP", cmd + 5))
            BspUart_SendString("ERR:AKP\r\n");
        return;
    }
    if (strncmp(cmd, "#AKI=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("AKI", cmd + 5))
            BspUart_SendString("ERR:AKI\r\n");
        return;
    }
    if (strncmp(cmd, "#AKD=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("AKD", cmd + 5))
            BspUart_SendString("ERR:AKD\r\n");
        return;
    }
    if (strncmp(cmd, "#LKP=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("LKP", cmd + 5))
            BspUart_SendString("ERR:LKP\r\n");
        return;
    }
    if (strncmp(cmd, "#LKD=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("LKD", cmd + 5))
            BspUart_SendString("ERR:LKD\r\n");
        return;
    }
    if (strncmp(cmd, "#SFF=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("SFF", cmd + 5))
            BspUart_SendString("ERR:SFF\r\n");
        return;
    }
    if (strncmp(cmd, "#HTR=", 5) == 0)
    {
        if (!try_handle_legacy_param_write("HTR", cmd + 5))
            BspUart_SendString("ERR:HTR\r\n");
        return;
    }
    if (strcmp(cmd, "#STAT!") == 0)
    {
        BspUart_SendStat(g_sysState, g_mode,
                         g_pid.speedPID.kp, g_pid.speedPID.ki, g_pid.speedPID.kd,
                         g_pid.headingPID.kp, g_pid.headingPID.ki, g_pid.headingPID.kd,
                         g_lineTrack.kp, 0.0f, g_lineTrack.kd,
                         g_pid.targetSpeed);
        return;
    }
    if (strcmp(cmd, "#CAL!") == 0)
    {
        BspUart_SendString("OK:CAL\r\n");
        return;
    }
    BspUart_SendString("ERR\r\n");
}

/* ========== Control Loop ========== */

static void run_control(uint32_t now)
{
    const TuneRuntime_t *tune = TuneParams_Get();
    float dt, avgSpeed, dt_norm;
    float trackTargetSpeed, scaledTrackTarget, trackSpeedScale;
    uint8_t trackSpeedConstraintActive;

    dt = (float)(now - g_lastControlTick) * 0.001f;
    if (dt <= 0.0f)
        dt = 0.01f;
    if (dt > 0.5f)
        dt = 0.5f;
    g_lastControlTick = now;

    /* 控制周期的第一步永远是刷新编码器观测。 */
    Encoder_Update(&g_encoder);

    dt_norm = dt * 100.0f;
    if (dt_norm < 0.5f)
        dt_norm = 0.5f;
    {
        /* 原始编码器增量会受控制周期抖动影响，这里用 dt 归一化后再做低通。 */
        float nl = (float)g_encoder.leftSpeed / dt_norm;
        float nr = (float)g_encoder.rightSpeed / dt_norm;
        g_encoder.filteredLeftSpeed = tune->common.encoderSpeedLpfAlpha * nl
                                    + (1.0f - tune->common.encoderSpeedLpfAlpha) * g_encoder.filteredLeftSpeed;
        g_encoder.filteredRightSpeed = tune->common.encoderSpeedLpfAlpha * nr
                                     + (1.0f - tune->common.encoderSpeedLpfAlpha) * g_encoder.filteredRightSpeed;
    }

    if (!is_running())
        return;

    if (g_sysState == SYS_STRAIGHT)
    {
        avgSpeed = (g_encoder.filteredLeftSpeed + g_encoder.filteredRightSpeed) * 0.5f;
        DualLoop_ComputeStraight(&g_pid, avgSpeed, g_imu.yaw, g_fastYawRate, dt);
        MotorDriver_SetCoreDiff(g_pid.pwmCore, g_pid.headingDiffPWM);
        g_pid.leftPWM  = MotorDriver_GetActualL();
        g_pid.rightPWM = MotorDriver_GetActualR();
    }
    else if (g_sysState == SYS_TRACKING)
    {
        avgSpeed = (g_encoder.filteredLeftSpeed + g_encoder.filteredRightSpeed) * 0.5f;
        LineTrack_Update(now, g_imu.yaw, g_fastYawRate);

        if (!LineTrack_IsRunning())
        {
            transition_stop(EXP_TRIGGER_AUTO);
            return;
        }

        trackTargetSpeed = g_pid.targetSpeed;
        trackSpeedScale = LineTrack_GetSpeedScale();
        trackSpeedConstraintActive = LineTrack_IsSpeedConstraintActive();
        scaledTrackTarget = trackTargetSpeed * trackSpeedScale;
        /* 这里只临时压低本拍有效目标速度，不改用户设定的原始目标速度。 */
        if (trackTargetSpeed > tune->common.speedEntry && scaledTrackTarget < tune->common.speedEntry)
            scaledTrackTarget = tune->common.speedEntry;
        /* 不在这里把 speedRampTarget 一拍硬砍到缩放目标。
           真正的减速快慢统一交给 DualLoop_ApplySpeedRamp 的上下斜坡参数处理，
           这样短暂的 speedScale 波动不会把 sr 直接打穿。 */
        g_pid.targetSpeed = scaledTrackTarget;
        DualLoop_ComputeTrack(&g_pid, avgSpeed, dt,
                              LineTrack_GetYawCommand(),
                              LineTrack_GetYawLimit(),
                              LineTrack_GetHeadingDiffRatio(),
                              LineTrack_GetHeadingDiffMin(),
                              trackSpeedScale,
                              trackSpeedConstraintActive);
        g_pid.targetSpeed = trackTargetSpeed;
        MotorDriver_SetCoreDiff(g_pid.pwmCore, g_pid.headingDiffPWM);
        g_pid.leftPWM  = MotorDriver_GetActualL();
        g_pid.rightPWM = MotorDriver_GetActualR();
    }
}

static void run_imu_update(void)
{
    const TuneRuntime_t *tune = TuneParams_Get();
    float dt;
    uint32_t now = g_tickMs;
    uint8_t imuReadOk;
    /* IMU 更新时间戳独立维护，避免控制周期偶发抖动直接污染角速度估计。 */
    dt = (float)(now - g_lastImuTick) * 0.001f;
    if (dt <= 0.0f || dt > 0.5f)
        dt = 0.2f;
    imuReadOk = BNO085_ReadAll(&g_imu);
    if (!imuReadOk || !BNO085_IsReady() || !g_imu.ahrsInited)
    {
        /* IMU 一旦在运行中掉线，不能继续沿用上一拍差速。
           这里立刻切断控制并把恢复推迟到停车态，避免“IMU=1 + 小车原地自转”。 */
        g_fastYawRate = 0.0f;
        g_lastImuTick = g_tickMs;
        if (is_running())
            transition_stop(EXP_TRIGGER_AUTO);
        return;
    }
    BNO085_UpdateYaw(&g_imu, dt);
    /* Update gyro LPF ONLY when fresh IMU data arrives.
       Negate gyroZf: BNO085 Z-axis is inverted relative to
       game rotation vector yaw convention (Z pointing down).
       d(yaw)/dt > 0 = left turn, but gyroZf < 0 for left turn. */
    g_fastYawRate += tune->common.gyroFastLpfAlpha * (-g_imu.gyroZf - g_fastYawRate);
    g_lastImuTick = g_tickMs;
}

/* ========== Telemetry ========== */

