ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor-0417 copy/User/main.c
static void send_telemetry(void)
{
    uint32_t t = g_tickMs - g_runStartTick;
    uint8_t run = is_running();
    LineTrack_Snapshot_t trackSnapshot;

    if (g_sysState == SYS_TRACKING)
    {
        /* exp0409 的循迹遥测只保留核心前端量:
           pe  看前端误差是否被捕获态放大；
           yc  看目标航向生成是否够激进；
           ss  看弯中降速是否介入；
           ca  看是否真的进入了边缘捕获态；
           sc/dr/yl/ks 用来确认当前是不是已经切进 S 弯态以及拿到了多大的权限；
           cs 用来确认当前 capture 是否正处于“反向换边软接管”；
           rc 用来确认“重新看到中间灯后”回中重锁有没有真正介入。 */
        BspUart_SendTelemetryTrack(t, g_experimentId, run,
                                   g_encoder.leftSpeed, g_encoder.rightSpeed,
                                   g_imu.yaw, g_fastYawRate,
                                   g_pid.pwmCore, g_pid.headingDiffPWM,
                                   g_pid.leftPWM, g_pid.rightPWM,
                                   g_lineTrack.sensorBits,
                                   g_lineTrack.filteredPosition,
                                   g_lineTrack.targetLinePosition,
                                   g_lineTrack.effectiveError,
                                   g_lineTrack.yawCommand,
                                   g_lineTrack.targetYaw,
                                   g_lineTrack.lineDetected,
                                   g_pid.targetSpeed,
                                   g_pid.speedRampTarget,
                                   g_lineTrack.speedScale,
                                   g_lineTrack.captureActive,
                                   LineTrack_GetCaptureAuthorityScale(),
                                   g_lineTrack.captureSwitchActive,
                                   LineTrack_GetCaptureRateReliefScale(),
                                   LineTrack_GetRecenterScale(),
                                   LineTrack_IsSCurveActive(),
                                   LineTrack_GetHeadingDiffRatio(),
                                   LineTrack_GetYawLimit(),
                                   LineTrack_GetLineKpScale());
    }
    else if (g_mode == MODE_TRACK)
    {
        /* 只要当前模式已经切到 TRACK，就在待机心跳里发一份空载快照。
           这样 experiment_logger 在发 #RUN! 之前就能等到 sb/sc/ca/ld，
           不再只能盲等“用户说已经摆回起点”。 */
        LineTrack_CollectIdleSnapshot(g_imu.yaw, g_fastYawRate, &trackSnapshot);
        BspUart_SendTelemetryTrack(t, g_experimentId, run,
                                   g_encoder.leftSpeed, g_encoder.rightSpeed,
                                   g_imu.yaw, g_fastYawRate,
                                   0, 0,
                                   0, 0,
                                   trackSnapshot.sensorBits,
                                   trackSnapshot.linePosition,
                                   trackSnapshot.targetLinePosition,
                                   trackSnapshot.effectiveError,
                                   trackSnapshot.yawCommand,
                                   trackSnapshot.targetYaw,
                                   trackSnapshot.lineDetected,
                                   g_pid.targetSpeed,
                                   g_pid.speedRampTarget,
                                   trackSnapshot.speedScale,
                                   trackSnapshot.captureActive,
                                   trackSnapshot.captureAuthorityScale,
                                   trackSnapshot.captureSwitchActive,
                                   trackSnapshot.captureRateReliefScale,
                                   trackSnapshot.recenterScale,
                                   trackSnapshot.sCurveActive,
                                   trackSnapshot.headingDiffRatio,
                                   trackSnapshot.yawLimit,
                                   trackSnapshot.lineKpScale);
    }
    else
    {
        BspUart_SendTelemetryStraight(t, g_experimentId, run,
                                      g_encoder.leftSpeed, g_encoder.rightSpeed,
                                      g_imu.yaw, g_fastYawRate,
                                      g_pid.pwmCore, g_pid.headingDiffPWM,
                                      g_pid.dTermPostDZ,
                                      g_pid.leftPWM, g_pid.rightPWM,
                                      g_pid.lastHi,
                                      g_pid.targetSpeed,
                                      g_pid.speedRampTarget);
    }
}

/* ========== Display (event-driven, not every frame) ========== */

static void update_display(uint32_t now)
{
    /* 运行中跳过OLED更新: I2C写阻塞20-30ms会导致控制循环错过tick,
     * 造成速度环输出周期性骤降(约每1.1s一次) */
    if (is_running())
        return;

    if (!g_displayDirty && (now - g_lastDisplayTick) < 200u)
        return;
    g_lastDisplayTick = now;
    g_displayDirty = 0;

    BspOled_ShowStatus(g_sysState, g_mode,
                       g_imu.yaw,
                       (float)g_encoder.leftSpeed,
                       (float)g_encoder.rightSpeed,
                       g_experimentId);
}

static void service_imu_recovery(uint32_t now)
{
    if (is_running())
        return;
    if (BNO085_IsReady())
        return;
    if ((now - g_lastImuRecoverTick) < IMU_RECOVERY_RETRY_MS)
        return;

    g_lastImuRecoverTick = now;
    BNO085_Service();
    g_displayDirty = 1;
}

/* ========== Main Entry ========== */

int main(void)
{
    char cmdBuf[64];
    uint32_t now;

    /* Phase 1: BSP init */
    BspOled_Init();
    BspKey_Init();
    BspUart_Init();
    BspOled_ShowFaultCode(FaultTrace_GetAndClearCode());

    /* Phase 2: System timer first, so boot diagnostics still advance if IMU init blocks */
    Timer_Init();
    BspOled_ShowIMUInit(BNO085_GetInitStage(), BNO085_GetI2CAddr());

    /* Phase 3: Drivers */
    MotorDriver_Init();
    Encoder_Init();
    BNO085_Init();
    BspOled_ShowIMUInit(BNO085_GetInitStage(), BNO085_GetI2CAddr());
    LineSensor_Init();

    /* Phase 4: Control */
    TuneParams_Init();
    DualLoop_Init(&g_pid);
    LineTrack_Init();
    memset(&g_encoder, 0, sizeof(g_encoder));
    memset(&g_imu, 0, sizeof(g_imu));

    g_displayDirty = 1;

    while (1)
    {
        now = g_tickMs;

        /* 1. Command parsing */
        if (BspUart_TakeCommand(cmdBuf, sizeof(cmdBuf)))
        {
            handle_command(cmdBuf);
        }

        /* 2. IMU update FIRST so control always uses fresh data */
        if ((now - g_lastImuTick) >= IMU_READ_PERIOD_MS)
        {
            run_imu_update();
        }

        /* IMU 恢复只允许在停车态做，避免运行中重初始化把控制环卡死。 */
        service_imu_recovery(now);

        /* 3. Control loop (10ms period) */
        if (g_controlFlag)
        {
            g_controlFlag = 0;
            run_control(now);
        }

        /* 3. Telemetry */
        if ((now - g_lastTelemetryTick) >= TELEMETRY_PERIOD_MS)
        {
            g_lastTelemetryTick = now;
            send_telemetry();
        }

        /* 4. Display (200ms or on state change) */
        update_display(now);

        /* 5. Key events */
        process_key_event();
    }
}
